# Data Inconsistency / Anomalies Handling
- Defination: Data inconsistency is the lack of standardization and uniformity in data across different sources, systems, or formats. This results in different data sources containing conflicting, inaccurate, or incomplete information about the same entity or attribute

## Types of Inconsistency:
- Inconsistency format
- Inconsistency Naming Consentency
- Typogharpical Error
- Duplicates Hanlding
- Contradictory Data

### Methods used to handle the Inconsistency
- Missing data
- Detection of data

### In ***Python languauge*** to measure the Consistency, we use the such libraries:
- Pandas
- Numpy
- Sklearn

In [171]:
#Import the libraries:
import pandas as pd
import numpy as np

In [172]:
#Make a dataset:
df = pd.DataFrame({
    "date" : ['2022/05/02', '02-05-2022', '05-02-2022', '02/05/2021'],
    "country" : ['United State of America', 'USA', 'U.S.A', 'America'],
    "name" : ['Jhon', 'Jone', 'John', 'Jonh'],
    "sales_2022" : [200, None, 300, 400],
    "sales_2021" : [100, None, 200, None]
})
#Check the dataset:
print(df)

         date                  country  name  sales_2022  sales_2021
0  2022/05/02  United State of America  Jhon       200.0       100.0
1  02-05-2022                      USA  Jone         NaN         NaN
2  05-02-2022                    U.S.A  John       300.0       200.0
3  02/05/2021                  America  Jonh       400.0         NaN

In [173]:
#Standard the Dataformate:
df['date'] = pd.to_datetime(df['date'] , errors='coerce')
#check the head:
df.head()

        date                  country  name  sales_2022  sales_2021
0 2022-05-02  United State of America  Jhon       200.0       100.0
1        NaT                      USA  Jone         NaN         NaN
2        NaT                    U.S.A  John       300.0       200.0
3        NaT                  America  Jonh       400.0         NaN

In [174]:
#Apply at whole column:
df['date'] = df['date'].dt.strftime('%d-%m-%y')
#Check the whole column:
df['date'].head()

0    02-05-22
1         NaN
2         NaN
3         NaN
Name: date, dtype: object

In [175]:
#fill the missing values in date colum:
df['date'] = df['date'].fillna('02-05-22')
#Make a head
df.head()

       date                  country  name  sales_2022  sales_2021
0  02-05-22  United State of America  Jhon       200.0       100.0
1  02-05-22                      USA  Jone         NaN         NaN
2  02-05-22                    U.S.A  John       300.0       200.0
3  02-05-22                  America  Jonh       400.0         NaN

In [176]:
#Make the country mapp:
country_mapping = {'United State of America':'USA', 'U.S.A':'USA', 'America':'USA'}
#Horomonize the name of country:
df['country'] = df['country'].replace(country_mapping)

In [177]:
#Check the head:
df.head()

       date country  name  sales_2022  sales_2021
0  02-05-22     USA  Jhon       200.0       100.0
1  02-05-22     USA  Jone         NaN         NaN
2  02-05-22     USA  John       300.0       200.0
3  02-05-22     USA  Jonh       400.0         NaN

In [178]:
#Correct the typographical mistake of  name in name column:
df['name'] = df['name'].replace({'Jone':'Jhon', 'John':'Jhon', 'Jonh':'Jhon'})

In [179]:
#Check the head
df.head()

       date country  name  sales_2022  sales_2021
0  02-05-22     USA  Jhon       200.0       100.0
1  02-05-22     USA  Jhon         NaN         NaN
2  02-05-22     USA  Jhon       300.0       200.0
3  02-05-22     USA  Jhon       400.0         NaN

In [180]:
#Fill the missing values in sale_2022 column with median:
df['sales_2022'] = df['sales_2022'].fillna(df['sales_2022'].median())

In [181]:
#Check the dataset:
df.head()

       date country  name  sales_2022  sales_2021
0  02-05-22     USA  Jhon       200.0       100.0
1  02-05-22     USA  Jhon       300.0         NaN
2  02-05-22     USA  Jhon       300.0       200.0
3  02-05-22     USA  Jhon       400.0         NaN

In [182]:
# Drop the duplicates:
df = df.drop('sales_2021', axis=1)

In [183]:
df.head()

       date country  name  sales_2022
0  02-05-22     USA  Jhon       200.0
1  02-05-22     USA  Jhon       300.0
2  02-05-22     USA  Jhon       300.0
3  02-05-22     USA  Jhon       400.0